Catalogs/DMS_РесурсныеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_РесурсныеСпецификации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАвторабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКлючСвязи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставАвторабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_КодыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвязанныеАвтоработы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_КодыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурснаяСпецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключаемыеАвтоработы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_КодыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурснаяСпецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Renault_АвтомобилиДопРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтомобилиДопРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СемействоАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СемействаАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СалонныйФильтр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГУР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AC</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоПринятоНаСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамечаниеПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриемкиНаСклад</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМоделиДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексМоделиДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМоделиКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексМоделиКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодТипаКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ФазыМоделей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продавец</Name>
					<Comment>Дилерский центр, который продал авто</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТоплива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ABS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПривода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПриводАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегионЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Регионы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОСАГО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияОСАГО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаКАСКО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияКАСКО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКлиматическойУстановки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/DMS_КодыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_КодыОпераций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Нормочасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Нормочасы</Name>
			<Comment>Нормочасы авторабот</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта нормочаса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена нормочаса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_РесурсныеСпецификации/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Модель") Тогда
		Модель = Параметры.Модель;
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли; 
	
	Если Параметры.Свойство("ТипЦены") Тогда
		ТипЦены = Параметры.ТипЦены;
	КонецЕсли; 
	
	Если Параметры.Свойство("Валюта") Тогда
		Валюта = Параметры.Валюта;
	КонецЕсли; 
	
	Если Параметры.Свойство("Нормочас") Тогда
		Нормочас = Параметры.Нормочас;
	КонецЕсли;
	
	Если Параметры.Свойство("Цех") Тогда
		Цех = Параметры.Цех;
	КонецЕсли; 
	
	Если Параметры.Свойство("ВидРемонта") Тогда
		ВидРемонта = Параметры.ВидРемонта;
	КонецЕсли; 
	
	Если Параметры.Свойство("ДоговорВзаиморасчетов") Тогда
		ДоговорВзаиморасчетов = Параметры.ДоговорВзаиморасчетов;
	КонецЕсли;
	
	Если Параметры.Свойство("ИндексМоделиДвигателя") Тогда
		ИндексМоделиДвигателя = Параметры.ИндексМоделиДвигателя;
	КонецЕсли; 
	
	Если Параметры.Свойство("КодМоделиКПП") Тогда
		КодМоделиКПП = Параметры.КодМоделиКПП;
	КонецЕсли;
	
	Если Параметры.Свойство("КодМоделиДвигателя") Тогда
		КодМоделиДвигателя = Параметры.КодМоделиДвигателя;
	КонецЕсли;
	
	Если Параметры.Свойство("ИндексМоделиКПП") Тогда
		ИндексМоделиКПП = Параметры.ИндексМоделиКПП;
	КонецЕсли;

	Если Параметры.Свойство("КодТипаКузова") Тогда
		КодТипаКузова = Параметры.КодТипаКузова;
	КонецЕсли;
	
	Если Параметры.Свойство("Автомобиль") Тогда
		
		Автомобиль = Параметры.Автомобиль;
		
		Критерии = РегистрыСведений.Renault_АвтомобилиДопРеквизиты.ПолучитьКритерииПоАвтомобилю(Автомобиль);
		
		Если ЗначениеЗаполнено(Критерии) Тогда
			
			КодМоделиДвигателя = Критерии[0].КодМоделиДвигателя;
			ИндексМоделиДвигателя = Критерии[0].ИндексМоделиДвигателя;
			КодМоделиКПП = Критерии[0].КодМоделиКПП; 
			ИндексМоделиКПП = Критерии[0].ИндексМоделиКПП;
			КодТипаКузова = Критерии[0].КодТипаКузова;
			КодКлиматическойУст = ?(Критерии[0].AC, "11", "5");
			
		КонецЕсли;
		
	КонецЕсли;
	
	КодОперации = Справочники.DMS_КодыОпераций.ПолучитьКодОперацииПоМодели(Модель);
	
	Элементы.КодМоделиДвигателя.СписокВыбора.ЗагрузитьЗначения(Renault_АвтосервисСерверПовтИспользования.ПолучитьВесьСписокПритериевКодДвигателя("MOT3", КодОперации).ВыгрузитьЗначения());
	Элементы.ИндексМоделиДвигателя.СписокВыбора.ЗагрузитьЗначения(Renault_АвтосервисСерверПовтИспользования.ПолучитьВесьСписокПритериевКодДвигателя("MOTI", КодОперации).ВыгрузитьЗначения());
	Элементы.КодМоделиКПП.СписокВыбора.ЗагрузитьЗначения(Renault_АвтосервисСерверПовтИспользования.ПолучитьВесьСписокПритериевКодДвигателя("BVI3", КодОперации).ВыгрузитьЗначения());
	Элементы.ИндексМоделиКПП.СписокВыбора.ЗагрузитьЗначения(Renault_АвтосервисСерверПовтИспользования.ПолучитьВесьСписокПритериевКодДвигателя("BVII", КодОперации).ВыгрузитьЗначения());
	Элементы.КодТипаКузова.СписокВыбора.ЗагрузитьЗначения(Renault_АвтосервисСерверПовтИспользования.ПолучитьВесьСписокПритериевКодДвигателя("$TYC", КодОперации).ВыгрузитьЗначения());               	
	Элементы.КодКлУстановки.СписокВыбора.ЗагрузитьЗначения(Renault_АвтосервисСерверПовтИспользования.ПолучитьВесьСписокПритериевКодДвигателя("AIRC", КодОперации).ВыгрузитьЗначения());               	

	
	Если Элементы.ИндексМоделиДвигателя.СписокВыбора.НайтиПоЗначению(ИндексМоделиДвигателя) = Неопределено Тогда
		
		Элементы.ИндексМоделиДвигателя.СписокВыбора.Добавить(ИндексМоделиДвигателя);
		
	КонецЕсли;
	
	Если Элементы.КодМоделиДвигателя.СписокВыбора.НайтиПоЗначению(КодМоделиДвигателя) = Неопределено Тогда
		
		Элементы.КодМоделиДвигателя.СписокВыбора.Добавить(КодМоделиДвигателя);
		
	КонецЕсли;
	
	Если Элементы.КодКлУстановки.СписокВыбора.НайтиПоЗначению(КодКлиматическойУст) = Неопределено Тогда
		
		Элементы.КодКлУстановки.СписокВыбора.Добавить(КодКлиматическойУст);
		
	КонецЕсли;
	
	Если Элементы.КодМоделиКПП.СписокВыбора.НайтиПоЗначению(КодМоделиКПП) = Неопределено Тогда
		
		Элементы.КодМоделиКПП.СписокВыбора.Добавить(КодМоделиКПП);
		
	КонецЕсли;
	
	Если Элементы.ИндексМоделиКПП.СписокВыбора.НайтиПоЗначению(ИндексМоделиКПП) = Неопределено Тогда
		
		Элементы.ИндексМоделиКПП.СписокВыбора.Добавить(ИндексМоделиКПП);
		
	КонецЕсли;
	
	Если Элементы.КодТипаКузова.СписокВыбора.НайтиПоЗначению(КодТипаКузова) = Неопределено Тогда
		
		Элементы.КодТипаКузова.СписокВыбора.Добавить(КодТипаКузова);
		
	КонецЕсли;
	
	ТаблицаПереноса = "Список";
	
	УстановитьПривилегированныйРежим(Истина);
	//ДоступнаПятаяВерсия = ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "5";
	ДоступнаПятаяВерсия = Истина;
	УстановитьПривилегированныйРежим(Ложь);
	
	ГруппаАвтоработРено = Справочники.Автоработы.НайтиПоНаименованию("DMS Renault",Истина);
	
	СформироватьДеревоСпецификаций(Отказ); 
	
	Если Отказ Тогда
	
		Сообщить("По модели <"+СокрЛП(Модель)+"> нет данных для подбора авторабот",СтатусСообщения.Информация);
		Возврат;
		
	КонецЕсли; 
	
	Список.Параметры.УстановитьЗначениеПараметра("РесурснаяСпецификация", Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("КодОперации", 		  Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("Модель", 		 		  Модель);
	Список.Параметры.УстановитьЗначениеПараметра("ВидРемонта", 		 	  ВидРемонта);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступнаПятаяВерсия",   ДоступнаПятаяВерсия);
	Список.Параметры.УстановитьЗначениеПараметра("Нормочас",   			  Нормочас);
	Список.Параметры.УстановитьЗначениеПараметра("Код", 		 	  	  КодОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Артикул",   			  АртикулОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Наименование",   		  НаименованиеОтбор);
	
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("РесурснаяСпецификация", Неопределено);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("КодОперации", 		  	Неопределено);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Модель", 		 		Модель);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Авторабота", 		 	Неопределено);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ВремяВыполнения", 		Неопределено);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ВидРемонта", 		 	ВидРемонта);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ДоступнаПятаяВерсия",   ДоступнаПятаяВерсия);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Нормочас",   			Нормочас);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЭтоАдресВременногоХранилища(ВыбранноеЗначение) Тогда
		Закрыть(ВыбранноеЗначение);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	АдресХранилища = ПоместитьВоВременноеХранилищеНаСервере();
	
	Закрыть(АдресХранилища);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоСпецификаций(Отказ = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Модели.Ссылка КАК КодОперации,
		|	Модели.Модель КАК Модель,
		|	Модели.Модель.Наименование + "" ("" + Модели.Ссылка.Код + "")"" КАК Наименование
		|ПОМЕСТИТЬ МоделиОперации
		|ИЗ
		|	Справочник.DMS_КодыОпераций.Модели КАК Модели
		|ГДЕ
		|	Модели.Модель = &Модель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МоделиОперации.КодОперации КАК КодОперации,
		|	МоделиОперации.Наименование КАК МодельПредставление,
		|	СоставАвторабот.Ссылка КАК РесурснаяСпецификация,
		|	ИСТИНА КАК ЭтоСпецификация
		|ИЗ
		|	Справочник.DMS_РесурсныеСпецификации.СоставАвторабот КАК СоставАвторабот
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МоделиОперации КАК МоделиОперации
		|		ПО СоставАвторабот.КодОперации = МоделиОперации.КодОперации
		|ИТОГИ
		|	МАКСИМУМ(КодОперации),
		|	МАКСИМУМ(ЭтоСпецификация)
		|ПО
		|	МодельПредставление,
		|	РесурснаяСпецификация ТОЛЬКО ИЕРАРХИЯ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		Отказ = Истина;
	КонецЕсли; 
	
	мДеревоСпецификаций = ДанныеФормыВЗначение(ДеревоСпецификаций,Тип("ДеревоЗначений"));
	
	мДеревоСпецификаций = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Для каждого ТекущаяСтрокаДерева Из мДеревоСпецификаций.Строки Цикл
		ТекущаяСтрокаДерева.ЭтоСпецификация = Ложь;	
	КонецЦикла;
	
	ЗначениеВДанныеФормы(мДеревоСпецификаций,ДеревоСпецификаций);

КонецПроцедуры // СформироватьДеревоСпецификаций()

&НаКлиенте
Процедура СписокСвязанныхРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СписокСвязанныхРабот.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	НоваяСтрока = ВыбранныеАвтоработы.Добавить();
	НоваяСтрока.Авторабота 		= ТекущаяСтрока.Авторабота;
	НоваяСтрока.ВремяВыполнения = ТекущаяСтрока.ВремяВыполнения;
	НоваяСтрока.Нормочас 		= ТекущаяСтрока.Нормочас;
	НоваяСтрока.Цена			= ТекущаяСтрока.Цена;
	НоваяСтрока.Количество 		= 1;
	
	УстановитьДекорациюИНадписьКорзины();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСвязанныхРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСвязанныхРаботПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСвязанныхРаботНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТаблицаПереноса = Элемент.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТаблицаПереноса = Элемент.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрокаСпецификаций = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	Если ПустаяСтрока(НаименованиеОтбор) И ПустаяСтрока(АртикулОтбор) И ПустаяСтрока(КодОтбор) Тогда	
		СпецификацияДляОтбора = ТекущаяСтрокаСпецификаций.РесурснаяСпецификация;
	Иначе 
		СпецификацияДляОтбора = ПустаяСпецификация;
	КонецЕсли; 
	
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("РесурснаяСпецификация", СпецификацияДляОтбора);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("КодОперации", 		  	ТекущаяСтрокаСпецификаций.КодОперации);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Модель", 		 		Модель);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Авторабота", 		 	ТекущаяСтрока.Авторабота);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ВремяВыполнения", 		ТекущаяСтрока.ВремяВыполнения);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ВидРемонта", 		 	ВидРемонта);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ДоступнаПятаяВерсия",   ДоступнаПятаяВерсия);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Нормочас",   			Нормочас);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь;
	
	НоваяСтрока = ВыбранныеАвтоработы.Добавить();
	НоваяСтрока.Авторабота 		= ТекущаяСтрока.Авторабота;
	НоваяСтрока.ВремяВыполнения = ТекущаяСтрока.ВремяВыполнения;
	НоваяСтрока.Нормочас 		= ТекущаяСтрока.Нормочас;
	НоваяСтрока.Цена			= ТекущаяСтрока.Цена;
	НоваяСтрока.Количество 		= 1;
	
	УстановитьДекорациюИНадписьКорзины();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НаименованиеОтбор) И ПустаяСтрока(АртикулОтбор) И ПустаяСтрока(КодОтбор) Тогда	
		СпецификацияДляОтбора = ТекущаяСтрока.РесурснаяСпецификация;
	Иначе
		СпецификацияДляОтбора = ПустаяСпецификация;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("РесурснаяСпецификация", СпецификацияДляОтбора);
	Список.Параметры.УстановитьЗначениеПараметра("КодОперации", 		  ТекущаяСтрока.КодОперации);
	Список.Параметры.УстановитьЗначениеПараметра("Модель", 		 		  Модель);
	Список.Параметры.УстановитьЗначениеПараметра("ВидРемонта", 		 	  ВидРемонта);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступнаПятаяВерсия",   ДоступнаПятаяВерсия);
	Список.Параметры.УстановитьЗначениеПараметра("Нормочас",   			  Нормочас);
	Список.Параметры.УстановитьЗначениеПараметра("Код", 		 	  	  КодОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Артикул",   			  АртикулОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Наименование",   		  НаименованиеОтбор);
		
	ДанныеАвторабот = Элементы.Список.ТекущиеДанные;
	
	Если УстанавливатьОтбор Тогда
		
		УстановитьОтбор();
		
	Иначе
		
		
		
	КонецЕсли;
	
	Если ДанныеАвторабот = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("РесурснаяСпецификация", СпецификацияДляОтбора);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("КодОперации", 		  	ТекущаяСтрока.КодОперации);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Модель", 		 		Модель);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Авторабота", 		 	ДанныеАвторабот.Авторабота);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ВремяВыполнения", 		ДанныеАвторабот.ВремяВыполнения);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ВидРемонта", 		 	ВидРемонта);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("ДоступнаПятаяВерсия",   ДоступнаПятаяВерсия);
	СписокСвязанныхРабот.Параметры.УстановитьЗначениеПараметра("Нормочас",   			Нормочас);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокАвторабот(Модель, РесурснаяСпецификация, КодОперации)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("РесурснаяСпецификация", РесурснаяСпецификация);
	Запрос.УстановитьПараметр("КодОперации", КодОперации);


	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СоставАвторабот.Авторабота КАК Авторабота,
	               |	СоставАвторабот.ВремяВыполнения КАК ВремяВыполнения,
	               |	Модели.Ссылка КАК Ссылка,
	               |	Модели.НомерСтроки КАК НомерСтроки,
	               |	Модели.Модель КАК Модель
	               |ИЗ
	               |	Справочник.DMS_РесурсныеСпецификации.СоставАвторабот КАК СоставАвторабот
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.DMS_КодыОпераций.Модели КАК Модели
	               |		ПО СоставАвторабот.КодОперации = Модели.Ссылка
	               |ГДЕ
	               |	(СоставАвторабот.Ссылка = &РесурснаяСпецификация
	               |			ИЛИ &РесурснаяСпецификация = ЗНАЧЕНИЕ(Справочник.DMS_РесурсныеСпецификации.ПустаяСсылка))
	               |	И Модели.Ссылка = &КодОперации
	               |	И Модели.Модель = &Модель";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ДеревоСпецификацийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПодобраноТоваровНажатие(Элемент)
	
	Если ВыбранныеАвтоработы.Количество() <> 0 Тогда
		
		КорзинаАвторабот = Новый Массив;
		
		Для каждого ТекущаяСтрока Из ВыбранныеАвтоработы Цикл
		
			СтруктураСтроки = Новый Структура("Авторабота,Нормочас,Цена,ВремяВыполнения,Количество");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
			
			КорзинаАвторабот.Добавить(СтруктураСтроки);
			
		КонецЦикла; 
		
		ПараметрыВыбора = Новый Структура("КорзинаАвторабот", КорзинаАвторабот);
		ОткрытьФорму("Справочник.DMS_РесурсныеСпецификации.Форма.ФормаКорзинаАвторабот", ПараметрыВыбора, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТележкаНажатие(Элемент)
	
	Если ВыбранныеАвтоработы.Количество() <> 0 Тогда
		
		КорзинаАвторабот = Новый Массив;
		
		Для каждого ТекущаяСтрока Из ВыбранныеАвтоработы Цикл
		
			СтруктураСтроки = Новый Структура("Авторабота,Нормочас,Цена,ВремяВыполнения,Количество");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
			
			КорзинаАвторабот.Добавить(СтруктураСтроки);
			
		КонецЦикла;
		
		ПараметрыВыбора = Новый Структура("КорзинаАвторабот", КорзинаАвторабот);
		ОткрытьФорму("Справочник.DMS_РесурсныеСпецификации.Форма.ФормаКорзинаАвторабот", ПараметрыВыбора, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТележкаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТележкаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Значение = ПараметрыПеретаскивания.Значение;
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда 
		
		Для каждого Выбраннаятрока Из Значение Цикл
			
			Если ТипЗнч(Выбраннаятрока) = Тип("ДанныеФормыЭлементДерева") Тогда
				Возврат;
			КонецЕсли; 
			
			ДанныеСтроки = Элементы[ТаблицаПереноса].ДанныеСтроки(Выбраннаятрока);
			
			НоваяСтрока = ВыбранныеАвтоработы.Добавить();
			НоваяСтрока.Авторабота 		= ДанныеСтроки.Авторабота;
			НоваяСтрока.ВремяВыполнения = ДанныеСтроки.ВремяВыполнения;
			НоваяСтрока.Цена			= ДанныеСтроки.Цена;
			НоваяСтрока.Нормочас		= ДанныеСтроки.Нормочас;
			НоваяСтрока.Количество 		= 1;
			
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Автоработы") Тогда 
		
		НоваяСтрока = ВыбранныеАвтоработы.Добавить();
		НоваяСтрока.Авторабота 		= Значение;
		НоваяСтрока.ВремяВыполнения = 0;
		НоваяСтрока.Цена			= Нормочас.Цена;
		НоваяСтрока.Нормочас 		= Справочники.Нормочасы.ПустаяСсылка();
		НоваяСтрока.Количество 		= 1;
		
	КонецЕсли; 
	
	УстановитьДекорациюИНадписьКорзины();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДекорациюИНадписьКорзины()

	Если ВыбранныеАвтоработы.Количество() = 0 Тогда
		Элементы.ДекорацияТележка.Картинка = БиблиотекаКартинок.DMS_ТележкаПустая;
		Элементы.НадписьПодобраноТоваров.Заголовок = "Перетащите автоработу в корзину";
	Иначе 
		Элементы.ДекорацияТележка.Картинка = БиблиотекаКартинок.DMS_ТележкаСТоварами;
		Элементы.НадписьПодобраноТоваров.Заголовок = "Подобрано: " + Формат(ВыбранныеАвтоработы.Количество(), "ЧЦ=10; ЧН=-; ЧГ=");
	КонецЕсли;
	
	Элементы.ПеренестиВДокумент.Видимость = (ВыбранныеАвтоработы.Количество() <> 0);
	
КонецПроцедуры // УстановитьДекорациюИНадписьКорзины()

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МодельПредставление.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСпецификаций.ЭтоСпецификация");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
КонецПроцедуры // УстановитьУсловноеОформление()

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	
	ТаблицаОтправки = ВыбранныеАвтоработы.Выгрузить();
	ТаблицаОтправки.Свернуть("Авторабота,ВремяВыполнения,Цена,Нормочас", "Количество");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтправки);
	
	ТаблицаОтправки = Неопределено;
	
КонецФункции // ПоместитьВоВременноеХранилищеНаСервере()

&НаКлиенте
Процедура АртикулОтборПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(АртикулОтбор) Тогда
		ДеревоСпецификацийПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
		
	Список.Параметры.УстановитьЗначениеПараметра("РесурснаяСпецификация", ПустаяСпецификация);
	Список.Параметры.УстановитьЗначениеПараметра("КодОперации", 		  ТекущаяСтрока.КодОперации);
	Список.Параметры.УстановитьЗначениеПараметра("Модель", 		 		  Модель);
	Список.Параметры.УстановитьЗначениеПараметра("ВидРемонта", 		 	  ВидРемонта);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступнаПятаяВерсия",   ДоступнаПятаяВерсия);
	Список.Параметры.УстановитьЗначениеПараметра("Нормочас",   			  Нормочас);
	Список.Параметры.УстановитьЗначениеПараметра("Код", 		 	  	  КодОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Артикул",   			  АртикулОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Наименование",   		  НаименованиеОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОтборПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(КодОтбор) Тогда
		ДеревоСпецификацийПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
		
	Список.Параметры.УстановитьЗначениеПараметра("РесурснаяСпецификация", ПустаяСпецификация);
	Список.Параметры.УстановитьЗначениеПараметра("КодОперации", 		  ТекущаяСтрока.КодОперации);
	Список.Параметры.УстановитьЗначениеПараметра("Модель", 		 		  Модель);
	Список.Параметры.УстановитьЗначениеПараметра("ВидРемонта", 		 	  ВидРемонта);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступнаПятаяВерсия",   ДоступнаПятаяВерсия);
	Список.Параметры.УстановитьЗначениеПараметра("Нормочас",   			  Нормочас);
	Список.Параметры.УстановитьЗначениеПараметра("Код", 		 	  	  КодОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Артикул",   			  АртикулОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Наименование",   		  НаименованиеОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОтборПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПустаяСтрока(НаименованиеОтбор) Тогда
		ДеревоСпецификацийПриАктивизацииСтроки(Неопределено);
	КонецЕсли; 
		
	Список.Параметры.УстановитьЗначениеПараметра("РесурснаяСпецификация", ПустаяСпецификация);
	Список.Параметры.УстановитьЗначениеПараметра("КодОперации", 		  ТекущаяСтрока.КодОперации);
	Список.Параметры.УстановитьЗначениеПараметра("Модель", 		 		  Модель);
	Список.Параметры.УстановитьЗначениеПараметра("ВидРемонта", 		 	  ВидРемонта);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступнаПятаяВерсия",   ДоступнаПятаяВерсия);
	Список.Параметры.УстановитьЗначениеПараметра("Нормочас",   			  Нормочас);
	Список.Параметры.УстановитьЗначениеПараметра("Код", 		 	  	  КодОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Артикул",   			  АртикулОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Наименование",   		  НаименованиеОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьУстановитьОтбор(Команда)
	
	УстанавливатьОтбор = НЕ УстанавливатьОтбор;
	
	Если УстанавливатьОтбор Тогда
		
		УстановитьОтбор();
		Элементы.СписокСнятьУстановитьОтбор.Картинка = БиблиотекаКартинок.ОтключитьОтбор;
		
	Иначе
		
		СнятьОтбор();
		Элементы.СписокСнятьУстановитьОтбор.Картинка = БиблиотекаКартинок.ОтборПоТекущемуЗначению;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтбор()
	
	Для Каждого Элемент из Список.Отбор.Элементы Цикл
		
		Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Авторабота") Тогда
			
			Список.Отбор.Элементы.Удалить(Элемент);
			Прервать;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НаименованиеОтбор) И ПустаяСтрока(АртикулОтбор) И ПустаяСтрока(КодОтбор) Тогда	
		СпецификацияДляОтбора = ТекущаяСтрока.РесурснаяСпецификация;
	Иначе
		СпецификацияДляОтбора = ПустаяСпецификация;
	КонецЕсли;
	
	ТаблицаАвторабот = ПолучитьСписокАвторабот(Модель, СпецификацияДляОтбора, КодОперации);
	
	Если ТаблицаАвторабот.Количество() > 0 Тогда
		
		Если НЕ ЗначениеЗаполнено(ИндексМоделиДвигателя) ИЛИ НЕ ЗначениеЗаполнено(КодМоделиДвигателя)
			ИЛИ НЕ ЗначениеЗаполнено(КодТипаКузова) ИЛИ НЕ ЗначениеЗаполнено(КодМоделиКПП) Тогда
			
			//ПоказатьПредупреждение(,"Для однозначного выбора, необходимо заполнить критерии автомобиля.");
			
		Иначе
			
			СтруктураКритериев = Новый Структура;
			СтруктураКритериев.Вставить("BVI3", КодМоделиКПП);
			СтруктураКритериев.Вставить("MOT3", КодМоделиДвигателя);
			СтруктураКритериев.Вставить("MOTII", ИндексМоделиДвигателя);
			СтруктураКритериев.Вставить("STYC", КодТипаКузова);
			СтруктураКритериев.Вставить("AIRC", КодКлиматическойУст);
			
			СписокАвторабот = ТаблицаАвторабот.ВыгрузитьКолонку("Авторабота");
			
			ПодходящиеРаботы = Renault_АвтосервисСерверПовтИспользования.НайтиПодходиящиеАвтоработы(СтруктураКритериев, СпецификацияДляОтбора, КодОперации);
			СписокОтбора = Новый СписокЗначений;
			СписокОтбора.ЗагрузитьЗначения(ПодходящиеРаботы);
			
			СнятьОтбор();
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Авторабота");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = СписокОтбора;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодМоделиДвигателяПриИзменении(Элемент)
	
	Если УстанавливатьОтбор Тогда
		
		УстановитьОтбор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодМоделиКПППриИзменении(Элемент)
	
	Если УстанавливатьОтбор Тогда
		
		УстановитьОтбор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексМоделиКПППриИзменении(Элемент)
	
	Если УстанавливатьОтбор Тогда
		
		УстановитьОтбор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодТипаКузоваПриИзменении(Элемент)
	
	Если УстанавливатьОтбор Тогда
		
		УстановитьОтбор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодКлУстановкиПриИзменении(Элемент)
	
	Если УстанавливатьОтбор Тогда
		
		УстановитьОтбор();
		
	КонецЕсли;
	
КонецПроцедуры
